ici-test-automation-feature-environment-readiness/ic-integration-tests/src/test/resources/eindkomst/iosab/ValidRequest_I_envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://skat.dk/begrebsmodel/2008/01/01/">
   <soapenv:Header/>
   <soapenv:Body>
<fase2:IndkomstOplysningSumAbonnentBestil_I_I xmlns:fase2="http://skat.dk/begrebsmodel/2008/01/01/" xmlns:n1="http://www.altova.com/samplexml/other-namespace" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tsk="http://skat.dk/begrebsmodel/xml/schemas/kontekst/2007/05/31/" xsi:schemaLocation="http://skat.dk/begrebsmodel/2008/01/01/ file:///I:/XML/Alle%20SKATXML%20eIndkomst/package/view/IndkomstOplysningSumAbonnentBestil_I_IType.xsd">
    <fase2:Kontekst>
        <tsk:HovedOplysninger>
            <tsk:TransaktionsID>IOSAB TestCase011 SKATXML</tsk:TransaktionsID>
            <tsk:TransaktionsTid>2012-10-24T09:30:47</tsk:TransaktionsTid>
        </tsk:HovedOplysninger>
    </fase2:Kontekst>
    <fase2:IndkomstOplysningSumAbonnentBestilInddata>
        <fase2:AbonnentAdgangStruktur>
            <fase2:AbonnentTypeKode>2166</fase2:AbonnentTypeKode>
            <fase2:AbonnementTypeKode>3189</fase2:AbonnementTypeKode>
            <fase2:AdgangFormålTypeKode>564</fase2:AdgangFormålTypeKode>
        </fase2:AbonnentAdgangStruktur>
        <fase2:AbonnentSamling>
            <fase2:Abonnent>
                <fase2:AbonnentStruktur>
                    <fase2:AbonnentVirksomhedStruktur>
                        <fase2:AbonnentVirksomhed>
                            <fase2:VirksomhedSENummer>19552101</fase2:VirksomhedSENummer>
                        </fase2:AbonnentVirksomhed>
                    </fase2:AbonnentVirksomhedStruktur>
                    <fase2:IndkomstOplysningAdgangMedarbejderIdentifikation/>
                </fase2:AbonnentStruktur>
                <fase2:IndkomstSøgeValg>
                    <fase2:IndkomstPersonSumSamling>
                        <fase2:PersonIndkomstSumSøgeStruktur>
                            <fase2:PersonCPRNummer>1909580060</fase2:PersonCPRNummer>
                            <fase2:IndkomstOplysningAdgangReferenceNummer>1. Maks 30 Karakterer lang</fase2:IndkomstOplysningAdgangReferenceNummer>
                            <fase2:SøgeÅrMånedLukketStruktur>
                                <fase2:SøgeÅrMånedFra>201005</fase2:SøgeÅrMånedFra>
                                <fase2:SøgeÅrMånedTil>201705</fase2:SøgeÅrMånedTil>
                            </fase2:SøgeÅrMånedLukketStruktur>
                        </fase2:PersonIndkomstSumSøgeStruktur>
                        <fase2:PersonIndkomstSumSøgeStruktur>
                            <fase2:PersonCPRNummer>1909541081</fase2:PersonCPRNummer>
                            <fase2:IndkomstOplysningAdgangReferenceNummer>1. Maks 30 Karakterer lang</fase2:IndkomstOplysningAdgangReferenceNummer>
                            <fase2:SøgeÅrMånedLukketStruktur>
                                <fase2:SøgeÅrMånedFra>201005</fase2:SøgeÅrMånedFra>
                                <fase2:SøgeÅrMånedTil>201705</fase2:SøgeÅrMånedTil>
                            </fase2:SøgeÅrMånedLukketStruktur>
                        </fase2:PersonIndkomstSumSøgeStruktur>
                        <fase2:PersonIndkomstSumSøgeStruktur>
                            <fase2:PersonCPRNummer>1512474019</fase2:PersonCPRNummer>
                            <fase2:IndkomstOplysningAdgangReferenceNummer>1. Maks 30 Karakterer lang</fase2:IndkomstOplysningAdgangReferenceNummer>
                            <fase2:SøgeÅrMånedLukketStruktur>
                                <fase2:SøgeÅrMånedFra>201005</fase2:SøgeÅrMånedFra>
                                <fase2:SøgeÅrMånedTil>201705</fase2:SøgeÅrMånedTil>
                            </fase2:SøgeÅrMånedLukketStruktur>
                        </fase2:PersonIndkomstSumSøgeStruktur>
                    </fase2:IndkomstPersonSumSamling>
                </fase2:IndkomstSøgeValg>
            </fase2:Abonnent>
        </fase2:AbonnentSamling>
    </fase2:IndkomstOplysningSumAbonnentBestilInddata>
</fase2:IndkomstOplysningSumAbonnentBestil_I_I>
   </soapenv:Body>
</soapenv:Envelope>